In [133]:
# Importamos las librerías que necesitamos

# Tratamiento de datos
import pandas as pd
import numpy as np

# Visualización
import matplotlib.pyplot as plt
import seaborn as sns

# Ocultamos las advertencias para evitar mensajes innecesarios
import warnings
warnings.filterwarnings("ignore")

# Configuración
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

In [134]:
# Lo primero que hacemos es cargar el dataframe que vamos a usar
df = pd.read_csv("spaces_hr_raw_data.csv")
df.head()

,Unnamed: 0,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,0,51,No,NaN,2015.722222,NaN,6,3,NaN,1,1,1,0,NaN,3,5,resEArch DIREcToR,3,NaN,"16280,83$","42330,17$",7,Y,No,13,"3,0",3,Full Time,0,NaN,5,"3,0",20,NaN,15,15,"16280,83$",1972,"195370,00$",NaN,NaN,Yes
1,1,52,No,NaN,2063.388889,NaN,1,4,Life Sciences,1,2,3,0,NaN,2,5,ManAGeR,3,NaN,NaN,"43331,17$",0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,NaN,1971,"199990,00$",NaN,NaN,1
2,2,42,No,travel_rarely,1984.253968,Research & Development,4,2,Technical Degree,1,3,3,0,NaN,3,5,ManaGER,4,Married,NaN,"41669,33$",1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,NaN,1981,"192320,00$",ManaGER - Research & Development,NaN,1
3,3,47,No,travel_rarely,1771.404762,NaN,2,4,Medical,1,4,1,1,NaN,3,4,ReseArCH DIrECtOr,3,Married,"14307,50$","37199,50$",3,Y,NaN,19,"3,0",2,Full Time,2,NaN,2,NaN,20,NaN,5,6,"14307,50$",1976,"171690,00$",NaN,NaN,False
4,4,46,No,NaN,1582.771346,NaN,3,3,Technical Degree,1,5,1,1,NaN,4,4,sAleS EXECUtIve,1,Divorced,"12783,92$","33238,20$",2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,"12783,92$",1977,NaN,NaN,NaN,0

In [135]:
df.columns

Index(['Unnamed: 0', 'age', 'attrition', 'businesstravel', 'dailyrate',
       'department', 'distancefromhome', 'education', 'educationfield',
       'employeecount', 'employeenumber', 'environmentsatisfaction', 'gender',
       'hourlyrate', 'jobinvolvement', 'joblevel', 'jobrole',
       'jobsatisfaction', 'maritalstatus', 'monthlyincome', 'monthlyrate',
       'numcompaniesworked', 'over18', 'overtime', 'percentsalaryhike',
       'performancerating', 'relationshipsatisfaction', 'standardhours',
       'stockoptionlevel', 'totalworkingyears', 'trainingtimeslastyear',
       'worklifebalance', 'yearsatcompany', 'yearsincurrentrole',
       'yearssincelastpromotion', 'yearswithcurrmanager',
       'sameasmonthlyincome', 'datebirth', 'salary', 'roledepartament',
       'numberchildren', 'remotework'],
      dtype='object')

In [136]:
df = df.drop(columns=['numberchildren', 'over18', 'yearsincurrentrole'])

In [137]:
df.columns

Index(['Unnamed: 0', 'age', 'attrition', 'businesstravel', 'dailyrate',
       'department', 'distancefromhome', 'education', 'educationfield',
       'employeecount', 'employeenumber', 'environmentsatisfaction', 'gender',
       'hourlyrate', 'jobinvolvement', 'joblevel', 'jobrole',
       'jobsatisfaction', 'maritalstatus', 'monthlyincome', 'monthlyrate',
       'numcompaniesworked', 'overtime', 'percentsalaryhike',
       'performancerating', 'relationshipsatisfaction', 'standardhours',
       'stockoptionlevel', 'totalworkingyears', 'trainingtimeslastyear',
       'worklifebalance', 'yearsatcompany', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary',
       'roledepartament', 'remotework'],
      dtype='object')

In [138]:
def exploracion_basica(df):
    print("=== EXPLORACIÓN BÁSICA DEL DATASET ===")
    print("\nPrimeras filas:")
    print(df.head())
    print("\nÚltimas filas:")
    print(df.tail())
    print("\nNúmero de filas y columnas:")
    print(df.shape)
    print("\nInformación general del DataFrame:")
    print(df.info())
    print("\nEstadísticas descriptivas:")
    print(df.describe())
    print("\nColumnas:")
    print(list(df.columns))

In [139]:
exploracion_basica(df)

=== EXPLORACIÓN BÁSICA DEL DATASET ===

Primeras filas:
   Unnamed: 0 age attrition businesstravel    dailyrate  \
0           0  51        No            NaN  2015.722222
1           1  52        No            NaN  2063.388889
2           2  42        No  travel_rarely  1984.253968
3           3  47        No  travel_rarely  1771.404762
4           4  46        No            NaN  1582.771346

                 department  distancefromhome  education    educationfield  \
0                       NaN                 6          3               NaN
1                       NaN                 1          4     Life Sciences
2   Research & Development                  4          2  Technical Degree
3                       NaN                 2          4           Medical
4                       NaN                 3          3  Technical Degree

   employeecount  employeenumber  environmentsatisfaction  gender  hourlyrate  \
0              1               1                        1       0         NaN
1              1               2                        3       0         NaN
2              1               3                        3       0         NaN
3              1               4                        1       1         NaN
4              1               5                        1       1         NaN

   jobinvolvement  joblevel              jobrole  jobsatisfaction  \
0               3         5   resEArch DIREcToR                 3
1               2         5             ManAGeR                 3
2               3         5             ManaGER                 4
3               3         4   ReseArCH DIrECtOr                 3
4               4         4     sAleS EXECUtIve                 1

  maritalstatus monthlyincome monthlyrate  numcompaniesworked overtime  \
0           NaN     16280,83$   42330,17$                   7       No
1           NaN           NaN   43331,17$                   0      NaN
2       Married           NaN   41669,33$                   1       No
3       Married     14307,50$   37199,50$                   3      NaN
4      Divorced     12783,92$   33238,20$                   2       No

   percentsalaryhike performancerating  relationshipsatisfaction  \
0                 13               3,0                         3
1                 14               3,0                         1
2                 11               3,0                         4
3                 19               3,0                         2
4                 12               3,0                         4

  standardhours  stockoptionlevel totalworkingyears  trainingtimeslastyear  \
0     Full Time                 0               NaN                      5
1           NaN                 1              34,0                      5
2           NaN                 0              22,0                      3
3     Full Time                 2               NaN                      2
4           NaN                 1               NaN                      5

  worklifebalance  yearsatcompany  yearssincelastpromotion  \
0             3,0              20                       15
1             3,0              33                       11
2             NaN              22                       11
3             NaN              20                        5
4             3,0              19                        2

   yearswithcurrmanager sameasmonthlyincome  datebirth      salary  \
0                    15           16280,83$       1972  195370,00$
1                     9                 NaN       1971  199990,00$
2                    15                 NaN       1981  192320,00$
3                     6           14307,50$       1976  171690,00$
4                     8           12783,92$       1977         NaN

                        roledepartament remotework
0                                   NaN        Yes
1                                   NaN          1
2   ManaGER  -  Research & Development           1
3                                   NaN      False
4                                   NaN          0

Últimas filas:
      Unnamed: 0 age attrition businesstravel    dailyrate department  \
1673        1673  43        No            NaN   488.944444        NaN
1674        1674  47        No            NaN  1973.984127        NaN
1675        1675  29        No  travel_rarely   290.035510        NaN
1676        1676  47        No  travel_rarely  1032.487286        NaN
1677        1677  32        No            NaN   556.256661        NaN

      distancefromhome  education educationfield  employeecount  \
1673               -26          3        Medical              1
1674                26          4            NaN              1
1675                15          3            NaN              1
1676                 4          3  Life Sciences              1
1677                 2          2  Life Sciences              1

      employeenumber  environmentsatisfaction  gender  hourlyrate  \
1673             824                        2       1         NaN
1674            1087                        4       1         NaN
1675             528                        3       0         NaN
1676              76                        3       1         NaN
1677             401                        4       1   69.532083

      jobinvolvement  joblevel                   jobrole  jobsatisfaction  \
1673               4         1       rESEaRcH SciEnTiST                 3
1674               3         5                  mANager                 3
1675               3         1       reSearch sCienTiSt                 4
1676               2         3   maNufACTURING DIREctOr                 2
1677               3         2       resEArch scIENTisT                 3

     maritalstatus monthlyincome monthlyrate  numcompaniesworked overtime  \
1673        Single      3949,17$   10267,83$                   4      NaN
1674       Married     15943,72$   41453,67$                   3       No
1675           NaN           NaN    6090,75$                   1       No
1676      Divorced      8339,32$   21682,23$                   8      Yes
1677        Single           NaN   11681,39$                   4      Yes

      percentsalaryhike performancerating  relationshipsatisfaction  \
1673                 12               3,0                         4
1674                 11               3,0                         3
1675                 19               3,0                         1
1676                 12               NaN                         3
1677                 14               3,0                         4

     standardhours  stockoptionlevel totalworkingyears  trainingtimeslastyear  \
1673           NaN                 0               NaN                      2
1674     Full Time                 1              27,0                      2
1675     Part Time                 0               6,0                      1
1676     Part Time                 1               NaN                      4
1677     Part Time                 0              10,0                      2

     worklifebalance  yearsatcompany  yearssincelastpromotion  \
1673             3,0               3                        1
1674             3,0               5                        1
1675             3,0               6                        1
1676             3,0              22                       14
1677             3,0               8                        0

      yearswithcurrmanager sameasmonthlyincome  datebirth      salary  \
1673                     2            3949,17$       1980         NaN
1674                     0           15943,72$       1976  191324,62$
1675                     5                 NaN       1994   28111,13$
1676                    10            8339,32$       1976  100071,84$
1677                     7                 NaN       1991   53914,11$

     roledepartament remotework
1673             NaN        Yes
1674             NaN      False
1675             NaN      False
1676             NaN        Yes
1677             NaN          0

Número de filas y columnas:
(1678, 39)

Información general del DataFrame:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1678 entries, 0 to 1677
Data columns (total 39 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Unnamed: 0                1678 non-null   int64
 1   age                       1678 non-null   object
 2   attrition                 1678 non-null   object
 3   businesstravel            877 non-null    object
 4   dailyrate                 1678 non-null   float64
 5   department                312 non-null    object
 6   distancefromhome          1678 non-null   int64
 7   education                 1678 non-null   int64
 8   educationfield            904 non-null    object
 9   employeecount             1678 non-null   int64
 10  employeenumber            1678 non-null   int64
 11  environmentsatisfaction   1678 non-null   int64
 12  gender                    1678 non-null   int64
 13  hourlyrate                411 non-null    float64
 14  jobinvolvement            1678 non-null   int64
 15  joblevel                  1678 non-null   int64
 16  jobrole                   1678 non-null   object
 17  jobsatisfaction           1678 non-null   int64
 18  maritalstatus             1003 non-null   object
 19  monthlyincome             1189 non-null   object
 20  monthlyrate               1678 non-null   object
 21  numcompaniesworked        1678 non-null   int64
 22  overtime                  982 non-null    object
 23  percentsalaryhike         1678 non-null   int64
 24  performancerating         1478 non-null   object
 25  relationshipsatisfaction  1678 non-null   int64
 26  standardhours             1327 non-null   object
 27  stockoptionlevel          1678 non-null   int64
 28  totalworkingyears         1129 non-null   object
 29  trainingtimeslastyear     1678 non-null   int64
 30  worklifebalance           1564 non-null   object
 31  yearsatcompany            1678 non-null   int64
 32  yearssincelastpromotion   1678 non-null   int64
 33  yearswithcurrmanager      1678 non-null   int64
 34  sameasmonthlyincome       1189 non-null   object
 35  datebirth                 1678 non-null   int64
 36  salary                    1393 non-null   object
 37  roledepartament           312 non-null    object
 38  remotework                1678 non-null   object
dtypes: float64(2), int64(19), object(18)
memory usage: 511.4+ KB
None

Estadísticas descriptivas:
        Unnamed: 0    dailyrate  distancefromhome    education  employeecount  \
count  1678.000000  1678.000000       1678.000000  1678.000000         1678.0
mean    838.500000   668.079714          4.504172     2.932658            1.0
std     484.541192   470.787298         14.652066     1.024270            0.0
min       0.000000   104.103175        -49.000000     1.000000            1.0
25%     419.250000   290.035510          2.000000     2.000000            1.0
50%     838.500000   556.256661          5.000000     3.000000            1.0
75%    1257.750000   971.956349         11.000000     4.000000            1.0
max    1677.000000  2063.388889         29.000000     5.000000            1.0

       employeenumber  environmentsatisfaction       gender  hourlyrate  \
count     1678.000000              1678.000000  1678.000000  411.000000
mean       809.859952                 4.264005     0.398689   83.140768
std        467.084867                 6.912695     0.489774   57.272101
min          1.000000                 1.000000     0.000000   13.012897
25%        403.250000                 2.000000     0.000000   36.254439
50%        813.500000                 3.000000     0.000000   69.532083
75%       1215.750000                 4.000000     1.000000  116.987103
max       1614.000000                49.000000     1.000000  255.963294

       jobinvolvement     joblevel  jobsatisfaction  numcompaniesworked  \
count     1678.000000  1678.000000      1678.000000         1678.000000
mean         2.740763     2.064362         2.743147            2.670441
std          0.710359     1.099425         1.105172            2.501133
min          1.000000     1.000000         1.000000            0.000000
25%          2.000000     1.000000         2.000000            1.000000
50%          3.000000     2.000000         3.000000            2.000000
75%          3.000000     3.000000         4.000000            4.000000
max          4.000000     5.000000         4.000000            9.000000

       percentsalaryhike  relationshipsatisfaction  stockoptionlevel  \
count        1678.000000               1678.000000       1678.000000
mean           15.154350                  2.700238          0.787843
std             3.649607                  1.079494          0.843252
min            11.000000                  1.000000          0.000000
25%            12.000000                  2.000000          0.000000
50%            14.000000                  3.000000          1.000000
75%            18.000000                  4.000000          1.000000
max            25.000000                  4.000000          3.000000

       trainingtimeslastyear  yearsatcompany  yearssincelastpromotion  \
count            1678.000000     1678.000000              1678.000000
mean                2.795590        7.124553                 2.241955
std                 1.288657        6.173837                 3.246554
min                 0.000000        0.000000                 0.000000
25%                 2.000000        3.000000                 0.000000
50%                 3.000000        5.000000                 1.000000
75%                 3.000000        9.000000                 3.000000
max                 6.000000       40.000000                15.000000

       yearswithcurrmanager    datebirth
count           1678.000000  1678.000000
mean               4.200238  1986.047080
std                3.554224     9.154908
min                0.000000  1963.000000
25%                2.000000  1980.000000
50%                3.000000  1987.000000
75%                7.000000  1993.000000
max               17.000000  2005.000000

Columnas:
['Unnamed: 0', 'age', 'attrition', 'businesstravel', 'dailyrate', 'department', 'distancefromhome', 'education', 'educationfield', 'employeecount', 'employeenumber', 'environmentsatisfaction', 'gender', 'hourlyrate', 'jobinvolvement', 'joblevel', 'jobrole', 'jobsatisfaction', 'maritalstatus', 'monthlyincome', 'monthlyrate', 'numcompaniesworked', 'overtime', 'percentsalaryhike', 'performancerating', 'relationshipsatisfaction', 'standardhours', 'stockoptionlevel', 'totalworkingyears', 'trainingtimeslastyear', 'worklifebalance', 'yearsatcompany', 'yearssincelastpromotion', 'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary', 'roledepartament', 'remotework']

In [140]:
# Variables con valores nulos
def nulls(df,count=0,share=0):
    
    nulls = df.isnull().sum()
    nulls_share = df.isnull().sum()/df.shape[0]*100
    with_nulls_share = nulls_share[nulls_share > 0]
    
    if count == 1:
        print('Count of nulls')
        with_nulls = nulls[nulls > 0]
        print (with_nulls.sort_values(ascending=False))
        print('-----------------------------------')
    
    if share == 1:
        print('share of nulls')
        print (with_nulls_share.sort_values(ascending=False))
    
    nulls_list = with_nulls_share.to_frame(name='perc_nulos').reset_index().rename(columns={'index': 'var'})
    
    return nulls_list

In [141]:
nulls(df,1,1)

Count of nulls
department             1366
roledepartament        1366
hourlyrate             1267
businesstravel          801
educationfield          774
overtime                696
maritalstatus           675
totalworkingyears       549
monthlyincome           489
sameasmonthlyincome     489
standardhours           351
salary                  285
performancerating       200
worklifebalance         114
dtype: int64
-----------------------------------
share of nulls
department             81.406436
roledepartament        81.406436
hourlyrate             75.506555
businesstravel         47.735399
educationfield         46.126341
overtime               41.477950
maritalstatus          40.226460
totalworkingyears      32.717521
monthlyincome          29.141836
sameasmonthlyincome    29.141836
standardhours          20.917759
salary                 16.984505
performancerating      11.918951
worklifebalance         6.793802
dtype: float64

                    var  perc_nulos
0        businesstravel   47.735399
1            department   81.406436
2        educationfield   46.126341
3            hourlyrate   75.506555
4         maritalstatus   40.226460
5         monthlyincome   29.141836
6              overtime   41.477950
7     performancerating   11.918951
8         standardhours   20.917759
9     totalworkingyears   32.717521
10      worklifebalance    6.793802
11  sameasmonthlyincome   29.141836
12               salary   16.984505
13      roledepartament   81.406436

In [142]:
def detectar_duplicados(df):
    numero_duplicados = df.duplicated().sum()
    print(f"Filas duplicadas completas en el dataset: {numero_duplicados}")
    if numero_duplicados > 0:
        print("Aquí tienes las filas duplicadas:")
        print(df[df.duplicated()])

In [143]:
detectar_duplicados(df)

Filas duplicadas completas en el dataset: 0

### Exploramos columna por columna

In [144]:
df.columns

Index(['Unnamed: 0', 'age', 'attrition', 'businesstravel', 'dailyrate',
       'department', 'distancefromhome', 'education', 'educationfield',
       'employeecount', 'employeenumber', 'environmentsatisfaction', 'gender',
       'hourlyrate', 'jobinvolvement', 'joblevel', 'jobrole',
       'jobsatisfaction', 'maritalstatus', 'monthlyincome', 'monthlyrate',
       'numcompaniesworked', 'overtime', 'percentsalaryhike',
       'performancerating', 'relationshipsatisfaction', 'standardhours',
       'stockoptionlevel', 'totalworkingyears', 'trainingtimeslastyear',
       'worklifebalance', 'yearsatcompany', 'yearssincelastpromotion',
       'yearswithcurrmanager', 'sameasmonthlyincome', 'datebirth', 'salary',
       'roledepartament', 'remotework'],
      dtype='object')

In [148]:
df.drop(columns='Unnamed: 0', inplace=True)

### 'age'

In [149]:
df['age'].value_counts()

age
35              88
31              88
34              86
29              82
36              79
32              66
30              65
38              64
33              63
40              60
28              54
37              54
27              54
45              50
42              50
41              48
39              46
26              46
43              42
46              38
44              34
50              34
47              30
24              29
25              28
49              26
55              25
51              22
48              22
53              20
54              20
52              18
56              18
21              17
22              17
58              16
23              15
59              11
20              11
18               9
19               9
57               6
60               5
thirty-two       2
twenty-four      2
thirty           1
fifty-eight      1
fifty-two        1
twenty-six       1
fifty-five       1
thirty-seven     1
thirty-six       1
forty-seven      1
thirty-one       1
Name: count, dtype: int64

In [150]:
# transformamos las edades escritas en palabras a números
words_to_numbers = {
    'eighteen': 18,
    'nineteen': 19,
    'twenty': 20,
    'twenty-one': 21,
    'twenty-two': 22,
    'twenty-three': 23,
    'twenty-four': 24,
    'twenty-five': 25,
    'twenty-six': 26,
    'twenty-seven': 27,
    'twenty-eight': 28,
    'twenty-nine': 29,
    'thirty': 30,
    'thirty-one': 31,
    'thirty-two': 32,
    'thirty-three': 33,
    'thirty-four': 34,
    'thirty-five': 35,
    'thirty-six': 36,
    'thirty-seven': 37,
    'forty-seven': 47,
    'fifty-two': 52,
    'fifty-five': 55,
    'fifty-eight': 58
}

In [151]:
# reemplazamos palabras por números, y convertimos la columna a tipo numérico
df['age'] = df['age'].replace(words_to_numbers)
df['age'] = pd.to_numeric(df['age'], errors='coerce')

print(df['age'].dtype)
print(df['age'].value_counts().sort_index())

int64
age
18     9
19     9
20    11
21    17
22    17
23    15
24    31
25    28
26    47
27    54
28    54
29    82
30    66
31    89
32    68
33    63
34    86
35    88
36    80
37    55
38    64
39    46
40    60
41    48
42    50
43    42
44    34
45    50
46    38
47    31
48    22
49    26
50    34
51    22
52    19
53    20
54    20
55    26
56    18
57     6
58    17
59    11
60     5
Name: count, dtype: int64

### 'attrition'

In [152]:
df['attrition'].value_counts()

attrition
No     1406
Yes     272
Name: count, dtype: int64

In [153]:
df['attrition'] = df['attrition'].str.lower()
print(df['attrition'].value_counts())

attrition
no     1406
yes     272
Name: count, dtype: int64

### 'businesstravel'

In [154]:
df['businesstravel'].value_counts()

businesstravel
travel_rarely        616
travel_frequently    168
non-travel            93
Name: count, dtype: int64

In [155]:
df['businesstravel'] = df['businesstravel'].str.replace(' ', '_', regex=False)
df['businesstravel'] = df['businesstravel'].str.replace('-', '_', regex=False).str.lower()
print(df['businesstravel'].value_counts())

businesstravel
travel_rarely        616
travel_frequently    168
non_travel            93
Name: count, dtype: int64

### 'dailyrate'

In [156]:
df['dailyrate'].value_counts()

dailyrate
556.256661     326
290.035510     308
1032.487286    150
1582.771346     55
1973.984127     38
              ...
320.047619       1
470.063492       1
436.428571       1
501.325397       1
2004.785714      1
Name: count, Length: 673, dtype: int64

In [157]:
# reducimos a dos decimales los valores de la columna 'dailyrate'
df['dailyrate'] = df['dailyrate'].round(2)
print(df['dailyrate'].value_counts())

dailyrate
556.26     326
290.04     308
1032.49    150
1582.77     55
1973.98     38
          ...
320.05       1
470.06       1
436.43       1
501.33       1
2004.79      1
Name: count, Length: 673, dtype: int64

### 'department'

In [158]:
df['department'].value_counts()

department
Research & Development     203
Sales                       93
Human Resources             16
Name: count, dtype: int64

In [159]:
df['department'].unique()

array([nan, ' Research & Development ', ' Sales ', ' Human Resources '],
      dtype=object)

In [160]:
df['department'] = df['department'].apply(
    lambda x: x.strip().replace(' ', '_').lower() if pd.notna(x) else x
)

print(df['department'].value_counts())

department
research_&_development    203
sales                      93
human_resources            16
Name: count, dtype: int64

In [161]:
df['department'].isnull().sum()

1366

In [162]:
df['department'].unique()

array([nan, 'research_&_development', 'sales', 'human_resources'],
      dtype=object)

### 'distancefromhome'

In [163]:
df['distancefromhome'].value_counts()

distancefromhome
 2     228
 1     209
 9      89
 10     86
 8      85
      ...
-21      2
-34      2
-43      2
-39      1
-40      1
Name: count, Length: 69, dtype: int64

In [164]:
# pasamos la distancia a positivos, ya que hay valores negativos
df['distancefromhome'] = df['distancefromhome'].abs()
print(df['distancefromhome'].value_counts())

distancefromhome
2     228
1     209
10     92
9      89
8      85
7      82
3      79
5      65
4      64
6      63
24     37
16     37
12     33
13     33
11     33
18     32
15     31
25     31
26     30
29     30
23     30
14     28
19     23
20     23
17     22
21     22
22     21
28     20
27     18
47      8
35      8
38      7
31      6
36      6
42      6
45      6
48      5
37      5
46      5
32      4
41      4
30      4
33      3
44      3
34      2
49      2
43      2
39      1
40      1
Name: count, dtype: int64

### 'education'

In [165]:
df['education'].value_counts()

education
3    649
4    461
2    322
1    186
5     60
Name: count, dtype: int64

### 'educationfield'

In [166]:
df['educationfield'].value_counts()

educationfield
Life Sciences       367
Medical             286
Marketing           106
Technical Degree     70
Other                63
Human Resources      12
Name: count, dtype: int64

In [167]:
df['educationfield'] = (
    df['educationfield']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['educationfield'].value_counts())

educationfield
nan                 774
life_sciences       367
medical             286
marketing           106
technical_degree     70
other                63
human_resources      12
Name: count, dtype: int64

### 'employeecount'

In [168]:
df['employeecount'].value_counts()

employeecount
1    1678
Name: count, dtype: int64

In [169]:
# no aporta información útil, la eliminamos
df = df.drop(columns='employeecount')

### 'employeenumber'

In [170]:
df['employeenumber'].value_counts()

employeenumber
300     2
159     2
271     2
1158    2
191     2
       ..
547     1
546     1
545     1
544     1
1614    1
Name: count, Length: 1614, dtype: int64

In [171]:
df[df.duplicated(subset='employeenumber', keep=False)].sort_values('employeenumber')
# si sacamos la columna Unnamed: 0 podemos identificar las filas duplicadas - creo
    # voy a chequear -

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,remotework
8,41,no,NaN,1712.18,NaN,2,5,nan,9,2,1,NaN,3,4,mANAGEr,1,Married,"13829,17$","35955,83$",7,No,16,"3,0",2,Full Time,1,"22,0",2,"3,0",18,11,8,"13829,17$",1982,"165950,00$",NaN,True
1656,41,no,NaN,1712.18,NaN,2,5,nan,9,2,1,NaN,3,4,mANAGEr,1,Married,"13829,17$","35955,83$",7,No,16,"3,0",2,Full Time,1,"22,0",2,"3,0",18,11,8,"13829,17$",1982,"165950,00$",NaN,True
60,36,no,NaN,610.17,NaN,5,2,nan,61,4,0,NaN,3,2,lAboratORy TeChNiCiaN,2,Single,"4928,33$","12813,67$",8,No,16,"3,0",4,Full Time,0,"16,0",3,"4,0",13,3,7,"4928,33$",1987,"59140,00$",NaN,1
1652,36,no,NaN,610.17,NaN,5,2,nan,61,4,0,NaN,3,2,lAboratORy TeChNiCiaN,2,Single,"4928,33$","12813,67$",8,No,16,"3,0",4,Full Time,0,"16,0",3,"4,0",13,3,7,"4928,33$",1987,"59140,00$",NaN,1
1676,47,no,travel_rarely,1032.49,NaN,4,3,life_sciences,76,3,1,NaN,2,3,maNufACTURING DIREctOr,2,Divorced,"8339,32$","21682,23$",8,Yes,12,NaN,3,Part Time,1,NaN,4,"3,0",22,14,10,"8339,32$",1976,"100071,84$",NaN,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1638,48,no,travel_rarely,417.96,NaN,2,5,nan,1568,2,1,NaN,3,2,sALES EXEcuTIVe,4,Married,"3375,83$","8777,17$",2,No,14,"3,0",1,Part Time,1,"14,0",2,"3,0",9,6,7,"3375,83$",1975,"40510,00$",NaN,True
1657,45,no,travel_rarely,495.75,NaN,2,3,other,1569,4,0,NaN,3,2,sAles executiVe,2,NaN,NaN,"10410,83$",0,No,19,"3,0",2,Part Time,1,NaN,3,"4,0",8,3,7,NaN,1978,"48050,00$",NaN,False
1568,45,no,travel_rarely,495.75,NaN,2,3,other,1569,4,0,NaN,3,2,sAles executiVe,2,NaN,NaN,"10410,83$",0,No,19,"3,0",2,Part Time,1,NaN,3,"4,0",8,3,7,NaN,1978,"48050,00$",NaN,False
1671,31,no,NaN,556.26,NaN,12,3,medical,1608,4,1,NaN,3,2,HEaltHCarE REPreSENtAtIve,4,NaN,NaN,"11681,39$",0,NaN,11,"3,0",3,Part Time,2,"10,0",2,"1,0",9,8,5,NaN,1992,"53914,11$",NaN,True
1607,31,no,NaN,556.26,NaN,12,3,medical,1608,4,1,NaN,3,2,HEaltHCarE REPreSENtAtIve,4,NaN,NaN,"11681,39$",0,NaN,11,"3,0",3,Part Time,2,"10,0",2,"1,0",9,8,5,NaN,1992,"53914,11$",NaN,True

In [172]:
df = df.drop_duplicates()

In [173]:
df['employeenumber'].is_unique

True

In [174]:
df[df.duplicated(subset='employeenumber', keep=False)].sort_values('employeenumber')
#obs . age = más de 100 borrarlos o emparejarlos con la edad menor de la base 
# y luego buscar los duplicados
#age=unnamed

Empty DataFrame
Columns: [age, attrition, businesstravel, dailyrate, department, distancefromhome, education, educationfield, employeenumber, environmentsatisfaction, gender, hourlyrate, jobinvolvement, joblevel, jobrole, jobsatisfaction, maritalstatus, monthlyincome, monthlyrate, numcompaniesworked, overtime, percentsalaryhike, performancerating, relationshipsatisfaction, standardhours, stockoptionlevel, totalworkingyears, trainingtimeslastyear, worklifebalance, yearsatcompany, yearssincelastpromotion, yearswithcurrmanager, sameasmonthlyincome, datebirth, salary, roledepartament, remotework]
Index: []

In [175]:
print(f"Número de employeenumber duplicados: {df.duplicated(subset='employeenumber').sum()}")

Número de employeenumber duplicados: 0

### 'environmentsatisfaction'

In [176]:
df['environmentsatisfaction'].value_counts()

environmentsatisfaction
4     460
3     459
1     298
2     297
12      7
35      6
13      6
14      5
24      5
47      5
36      4
48      4
41      4
46      4
42      4
45      3
11      3
22      3
17      3
18      3
20      3
25      3
27      3
37      2
29      2
19      2
38      2
31      2
15      2
16      2
26      1
39      1
10      1
49      1
21      1
28      1
33      1
43      1
Name: count, dtype: int64

In [177]:
# detectamos valores no válidos, deberían ser del 1 al 4

df['environmentsatisfaction'] = df['environmentsatisfaction'].apply(
    lambda x: np.nan if x>4 else x
)

print(df['environmentsatisfaction'].value_counts())
# puede ser que acá esté el problema - cambiamos los que no están en el rango por nan, 
# no los sacamos de la muestra

environmentsatisfaction
4.0    460
3.0    459
1.0    298
2.0    297
Name: count, dtype: int64

In [178]:
df['department'].isnull().sum()

1312

In [179]:
# sustituimos los valores numéricos por texto para una mejor comprensión
satisfaction_map = {
    1: 'Low',
    2: 'Medium',
    3: 'High',
    4: 'Very High'
}

df['environmentsatisfaction'] = df['environmentsatisfaction'].replace(satisfaction_map)
print(df['environmentsatisfaction'].value_counts())

environmentsatisfaction
Very High    460
High         459
Low          298
Medium       297
Name: count, dtype: int64

In [180]:
df['environmentsatisfaction'] = (
    df['environmentsatisfaction']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['environmentsatisfaction'].value_counts())

environmentsatisfaction
very_high    460
high         459
low          298
medium       297
nan          100
Name: count, dtype: int64

### 'gender'

In [181]:
df['gender'].value_counts()

gender
0    971
1    643
Name: count, dtype: int64

In [182]:
# típicamente, 0 es femenino y 1 es masculino. Aún así, comprobamos con la media de dailyrate, que suele ser más alta en hombres que en mujeres
df.groupby('gender')['dailyrate'].mean()

gender
0    663.301771
1    679.191711
Name: dailyrate, dtype: float64

In [183]:
gender_map = {
    0: 'Female',
    1: 'Male'
}

df['gender'] = df['gender'].replace(gender_map)
df['gender'].value_counts()

gender
Female    971
Male      643
Name: count, dtype: int64

In [184]:
df['gender'] = df['gender'].astype(str).str.lower()
print(df['gender'].value_counts())

gender
female    971
male      643
Name: count, dtype: int64

### 'hourlyrate'

In [185]:
df['hourlyrate'].value_counts()

hourlyrate
36.254439     75
69.532083     74
129.060911    38
197.846418    14
246.748016     8
              ..
59.957341      1
28.205357      1
54.914683      1
227.487103     1
133.159722     1
Name: count, Length: 194, dtype: int64

In [186]:
df['hourlyrate'] = df['hourlyrate'].round(2)

### 'jobinvolvement'

In [187]:
df['jobinvolvement'].value_counts()

jobinvolvement
3    955
2    406
4    164
1     89
Name: count, dtype: int64

In [188]:
# sustituimos los valores numéricos por texto para una mejor comprensión
jobinvolvement_map = {
    1: 'Low',
    2: 'Medium',
    3: 'High',
    4: 'Very High'
}

df['jobinvolvement'] = df['jobinvolvement'].replace(jobinvolvement_map)
print(df['jobinvolvement'].value_counts())

jobinvolvement
High         955
Medium       406
Very High    164
Low           89
Name: count, dtype: int64

In [189]:
df['jobinvolvement'] = (
    df['jobinvolvement']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['jobinvolvement'].value_counts())

jobinvolvement
high         955
medium       406
very_high    164
low           89
Name: count, dtype: int64

### 'joblevel'

In [190]:
df['joblevel'].value_counts()

joblevel
2    597
1    586
3    242
4    113
5     76
Name: count, dtype: int64

In [191]:
# comprobamos la media de dailyrate por joblevel, para establecer una relación entre el nivel de trabajo y la remuneración
df.groupby('joblevel')['dailyrate'].mean()

joblevel
1     290.037526
2     556.258325
3    1032.489174
4    1582.770354
5    1973.982237
Name: dailyrate, dtype: float64

In [192]:
joblevel_map = {
    1: 'Entry Level',
    2: 'Intermediate',
    3: 'Senior',
    4: 'Manager',
    5: 'Executive'
}
df['joblevel'] = df['joblevel'].replace(joblevel_map)
print(df['joblevel'].value_counts())

joblevel
Intermediate    597
Entry Level     586
Senior          242
Manager         113
Executive        76
Name: count, dtype: int64

In [193]:
df['joblevel'] = (
    df['joblevel']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['joblevel'].value_counts())

joblevel
intermediate    597
entry_level     586
senior          242
manager         113
executive        76
Name: count, dtype: int64

### 'jobrole'

In [194]:
df['jobrole'].value_counts()

jobrole
mANager                       4
ManageR                       3
ManagEr                       3
mAnaGeR                       3
MANAgER                       3
                             ..
ResEArch ScieNTiST            1
HealthcARE RePreSENtAtiVe     1
ReSearcH scIEntist            1
LAbOrATOry techNicIan         1
mAnUfactURInG DiRECTOr        1
Name: count, Length: 1579, dtype: int64

In [195]:
df['jobrole'] = df['jobrole'].str.strip().str.lower().str.title()
df['jobrole'].value_counts()

jobrole
Sales Executive              369
Research Scientist           314
Laboratory Technician        278
Manufacturing Director       158
Healthcare Representative    149
Manager                      111
Sales Representative          90
Research Director             88
Human Resources               57
Name: count, dtype: int64

In [196]:
df['jobrole'] = (
    df['jobrole']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['jobrole'].value_counts())

jobrole
sales_executive              369
research_scientist           314
laboratory_technician        278
manufacturing_director       158
healthcare_representative    149
manager                      111
sales_representative          90
research_director             88
human_resources               57
Name: count, dtype: int64

### 'jobsatisfaction'

In [197]:
df['jobsatisfaction'].value_counts()

jobsatisfaction
4    514
3    481
1    317
2    302
Name: count, dtype: int64

In [198]:
satisfaction_map = {
    1: 'Low',
    2: 'Medium',
    3: 'High',
    4: 'Very High'
}

df['jobsatisfaction'] = df['jobsatisfaction'].replace(satisfaction_map)
print(df['jobsatisfaction'].value_counts())

jobsatisfaction
Very High    514
High         481
Low          317
Medium       302
Name: count, dtype: int64

In [199]:
df['jobsatisfaction'] = (
    df['jobsatisfaction']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['jobsatisfaction'].value_counts())

jobsatisfaction
very_high    514
high         481
low          317
medium       302
Name: count, dtype: int64

### 'maritalstatus'

In [201]:
df['maritalstatus'].value_counts()

maritalstatus
Married     404
Single      325
Divorced    188
Marreid      35
divorced     11
Name: count, dtype: int64

In [203]:
df['maritalstatus'] = df['maritalstatus'].str.strip().str.lower()
df['maritalstatus'] = df['maritalstatus'].replace({'marreid': 'married'})
print(df['maritalstatus'].value_counts())

maritalstatus
married     439
single      325
divorced    199
Name: count, dtype: int64

### 'monthlyincome'

In [204]:
df['monthlyincome'].value_counts()

monthlyincome
4492,84$     224
2342,59$     219
8339,32$      98
12783,92$     42
15943,72$     24
            ...
5415,83$       1
4994,17$       1
3806,67$       1
13920,00$      1
3705,83$       1
Name: count, Length: 493, dtype: int64

In [205]:
# transformamos la columna 'monthlyincome' para que sea numérica, eliminando el símbolo de dólar y la coma
df['monthlyincome'] = df['monthlyincome'].str.replace('$', '', regex=False)
df['monthlyincome'] = df['monthlyincome'].str.replace(',', '.', regex=False)
df['monthlyincome'] = pd.to_numeric(df['monthlyincome'], errors='coerce')

In [206]:
print(df['monthlyincome'].dtype)
df['monthlyincome'].describe()
df['monthlyincome'].value_counts()

float64

monthlyincome
4492.84     224
2342.59     219
8339.32      98
12783.92     42
15943.72     24
           ...
5415.83       1
4994.17       1
3806.67       1
13920.00      1
3705.83       1
Name: count, Length: 493, dtype: int64

### 'monthlyrate'

In [207]:
df['monthlyrate'].value_counts()

monthlyrate
11681,39$    317
6090,75$     295
21682,23$    139
33238,20$     55
41453,67$     37
            ...
6721,00$       1
9871,33$       1
9165,00$       1
10527,83$      1
42100,50$      1
Name: count, Length: 673, dtype: int64

In [208]:
# pasamos a str para corregir símbolos y puntos, luego convertimos a numérico
df['monthlyrate'] = df['monthlyrate'].astype(str)
df['monthlyrate'] = df['monthlyrate'].str.replace('$', '', regex=False)
df['monthlyrate'] = df['monthlyrate'].str.replace(',', '.', regex=False)
df['monthlyrate'] = pd.to_numeric(df['monthlyrate'], errors='coerce')
print(df['monthlyrate'].dtype)

float64

In [209]:
df['monthlyrate'].value_counts()

monthlyrate
11681.39    317
6090.75     295
21682.23    139
33238.20     55
41453.67     37
           ...
6721.00       1
9871.33       1
9165.00       1
10527.83      1
42100.50      1
Name: count, Length: 673, dtype: int64

### 'numcompaniesworked'

In [210]:
df['numcompaniesworked'].value_counts()

numcompaniesworked
1    573
0    226
3    169
4    157
2    156
7     84
6     73
5     66
9     59
8     51
Name: count, dtype: int64

### 'overtime'

In [211]:
df['overtime'].value_counts()

overtime
No     682
Yes    256
Name: count, dtype: int64

In [212]:
df['overtime'] = df['overtime'].str.strip().str.lower()
print(df['overtime'].value_counts())

overtime
no     682
yes    256
Name: count, dtype: int64

### 'percentsalaryhike'

In [213]:
# porcentaje de aumento salarial
df['percentsalaryhike'].value_counts()

percentsalaryhike
11    232
13    230
12    225
14    220
15    110
18     98
17     88
16     86
19     82
20     60
22     59
21     51
23     29
24     25
25     19
Name: count, dtype: int64

### 'performancerating'

In [214]:
df['performancerating'].value_counts()

performancerating
3,0    1205
4,0     214
Name: count, dtype: int64

In [215]:
# puede servir para descartar una hipótesis, por ejemplo: "¿El desempeño influye en que una persona se vaya o esté satisfecha?”

### 'standardhours'

In [216]:
df['standardhours'].value_counts()

standardhours
Part Time    888
Full Time    388
Name: count, dtype: int64

In [217]:
df['standardhours'] = (
    df['standardhours']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['standardhours'].value_counts())

standardhours
part_time    888
full_time    388
nan          338
Name: count, dtype: int64

### 'relationshipsatisfaction'

In [218]:
rel_map = {
    1: 'Low',
    2: 'Medium',
    3: 'High',
    4: 'Very High'
}
df['relationshipsatisfaction'] = df['relationshipsatisfaction'].replace(rel_map)
print(df['relationshipsatisfaction'].value_counts())

relationshipsatisfaction
High         504
Very High    468
Medium       339
Low          303
Name: count, dtype: int64

In [219]:
df['relationshipsatisfaction'] = (
    df['relationshipsatisfaction']
    .astype(str)                      
    .str.strip('_')                   
    .str.replace('_', ' ', regex=False)  
    .str.strip()                      
    .str.lower()                     
    .str.replace(' ', '_', regex=False)  
)
print(df['relationshipsatisfaction'].value_counts())

relationshipsatisfaction
high         504
very_high    468
medium       339
low          303
Name: count, dtype: int64

### 'stockoptionlevel'

In [220]:
df[ 'stockoptionlevel'].value_counts()

stockoptionlevel
0    687
1    666
2    172
3     89
Name: count, dtype: int64

In [221]:
# Esta variable indica el nivel de opciones sobre acciones que tiene asignadas cada persona. Es decir, si reciben parte de su compensación en acciones de la empresa. Los niveles más altos suelen asignarse a empleados de mayor nivel o con mejor rendimiento.
# 0: No stock options / 1-3: Diferentes niveles de acciones asignadas

### 'totalworkingyears'

In [222]:
df['totalworkingyears'].value_counts()

totalworkingyears
10,0    144
8,0      86
6,0      84
9,0      69
5,0      66
7,0      56
4,0      54
1,0      53
12,0     34
3,0      32
14,0     30
13,0     30
11,0     29
15,0     28
16,0     28
20,0     28
18,0     27
21,0     23
17,0     22
2,0      21
22,0     18
19,0     17
24,0     14
23,0     13
28,0     13
26,0      8
0,0       8
29,0      6
36,0      6
25,0      6
33,0      6
37,0      5
27,0      5
31,0      4
30,0      3
32,0      3
35,0      3
40,0      3
34,0      2
38,0      1
Name: count, dtype: int64

In [223]:
df['totalworkingyears'].isna().sum()

526

In [224]:
df['totalworkingyears'] = (
    df['totalworkingyears']
    .astype(str)
    .replace('<NA>', np.nan)                   
    .str.replace(',', '.', regex=False)        
    .astype(float)
    .astype('Int64')                           
)
print(df['totalworkingyears'].dtype)
print(df['totalworkingyears'].value_counts())

Int64
totalworkingyears
10    144
8      86
6      84
9      69
5      66
7      56
4      54
1      53
12     34
3      32
14     30
13     30
11     29
15     28
16     28
20     28
18     27
21     23
17     22
2      21
22     18
19     17
24     14
23     13
28     13
26      8
0       8
29      6
36      6
25      6
33      6
37      5
27      5
31      4
30      3
32      3
35      3
40      3
34      2
38      1
Name: count, dtype: Int64

### 'trainingtimeslastyear'

In [225]:
df['trainingtimeslastyear'].value_counts()

trainingtimeslastyear
2    598
3    534
4    137
5    136
1     77
6     72
0     60
Name: count, dtype: int64

### 'worklifebalance'

In [226]:
df['worklifebalance'].value_counts()

worklifebalance
3,0    913
2,0    359
4,0    155
1,0     79
Name: count, dtype: int64

In [227]:
df['worklifebalance'].isna().sum()

108

In [228]:
df['worklifebalance'] = df['worklifebalance'].str.replace(',', '.').astype(float)

df['worklifebalance'] = df['worklifebalance'].replace({
    1.0: 'very_low',
    2.0: 'low',
    3.0: 'good',
    4.0: 'excellent'
})
print(df['worklifebalance'].value_counts())

worklifebalance
good         913
low          359
excellent    155
very_low      79
Name: count, dtype: int64

### 'yearsatcompany'

In [229]:
df['yearsatcompany'].value_counts()

yearsatcompany
5     208
1     171
3     141
2     141
10    133
7     115
4     114
8     106
9      94
6      78
0      44
11     36
20     29
13     26
15     21
14     19
22     17
12     15
18     15
16     14
21     14
19     12
17      9
24      7
25      5
33      5
26      4
32      3
27      3
31      3
36      3
29      2
23      2
40      2
34      1
37      1
30      1
Name: count, dtype: int64

### 'yearssincelastpromotion'

In [230]:
df['yearssincelastpromotion'].value_counts()

yearssincelastpromotion
0     625
1     384
2     177
7      93
4      67
3      62
5      53
6      37
11     26
8      20
9      18
15     15
12     11
13     10
14     10
10      6
Name: count, dtype: int64

### 'yearswithcurrmanager'

In [231]:
df['yearswithcurrmanager'].value_counts()

yearswithcurrmanager
2     380
0     270
7     267
3     148
8     115
4     104
1      84
9      70
5      36
10     31
6      30
11     22
12     20
13     16
17      8
15      5
14      5
16      3
Name: count, dtype: int64

### 'sameasmonthlyincome'

In [232]:
df['sameasmonthlyincome'].value_counts()

sameasmonthlyincome
4492,84$     224
2342,59$     219
8339,32$      98
12783,92$     42
15943,72$     24
            ...
5415,83$       1
4994,17$       1
3806,67$       1
13920,00$      1
3705,83$       1
Name: count, Length: 493, dtype: int64

In [233]:
# eliminamos porque es una copia de 'monthlyincome'
df.drop(columns='sameasmonthlyincome', inplace=True)

### 'datebirth'

In [234]:
df['datebirth'].value_counts()

datebirth
1988    84
1992    83
1989    83
1994    78
1987    75
1991    65
1985    64
1993    64
1990    61
1983    60
1986    55
1996    54
1995    53
1981    50
1978    48
1982    46
1997    46
1984    45
1980    40
1977    38
1979    34
1973    31
1999    27
1976    27
1998    27
1968    25
1974    25
1969    20
1972    20
1970    20
1975    20
1971    19
1967    17
2001    16
2002    16
1965    15
2000    15
2003    11
1964    10
2004     9
2005     8
1963     5
1966     5
Name: count, dtype: int64

In [235]:
df['datebirth'].describe()

count    1614.000000
mean     1986.076208
std         9.101332
min      1963.000000
25%      1980.000000
50%      1987.000000
75%      1993.000000
max      2005.000000
Name: datebirth, dtype: float64

### 'salary'

In [236]:
df['salary'].value_counts()

salary
53914,11$     261
28111,13$     244
100071,84$    115
153407,07$     45
191324,62$     27
             ...
42210,00$       1
129360,00$      1
53680,00$       1
31960,00$       1
42440,00$       1
Name: count, Length: 583, dtype: int64

In [237]:
# nos aseguramos de que sea tipo texto
df['salary'] = df['salary'].astype(str)

# eliminamos el símbolo $ y reemplazamos la coma por punto
df['salary'] = df['salary'].str.replace('$', '', regex=False)
df['salary'] = df['salary'].str.replace(',', '.', regex=False)

# convertimos a número decimal (float)
df['salary'] = pd.to_numeric(df['salary'], errors='coerce')
print(df['salary'].dtype)
print(df['salary'].value_counts())

float64
salary
53914.11     261
28111.13     244
100071.84    115
153407.07     45
191324.62     27
            ...
42210.00       1
129360.00      1
53680.00       1
31960.00       1
42440.00       1
Name: count, Length: 583, dtype: int64

### 'roledepartament'

In [238]:
df['roledepartament'].value_counts()

roledepartament
MaNAgeR  -  Sales                                        2
ManaGER  -  Research & Development                       1
ReseaRch scIENTisT  -  Research & Development            1
ManufacTURInG DIRECtOR  -  Research & Development        1
hEalthCaRe reprEseNTaTiVe  -  Research & Development     1
                                                        ..
saLES eXEcUTiVE  -  Sales                                1
mANUfacTURiNG dIRectOR  -  Research & Development        1
huMAn ResOurces  -  Human Resources                      1
HUMAN ResoURCeS  -  Human Resources                      1
sAleS EXECUtIvE  -  Sales                                1
Name: count, Length: 301, dtype: int64

In [239]:
# ya tenemos las columnas 'jobrole' y 'department', así que eliminamos esta columna, que tiene un alto porcentaje de nulos
df.drop(columns='roledepartament', inplace=True)

### 'remotework'

In [240]:
df['remotework'].value_counts()

remotework
1        360
True     345
0        309
False    305
Yes      295
Name: count, dtype: int64

In [241]:
# Convertimos todo a string para estandarizar
df['remotework'] = df['remotework'].astype(str).str.strip().str.lower()

# Reemplazamos todas las variantes por 'yes' o 'no'
df['remotework'] = df['remotework'].replace({
    '1': 'yes',
    'true': 'yes',
    'yes': 'yes',
    '0': 'no',
    'false': 'no'
})
print(df['remotework'].value_counts())

remotework
yes    1000
no      614
Name: count, dtype: int64

In [242]:
df.columns

Index(['age', 'attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeenumber',
       'environmentsatisfaction', 'gender', 'hourlyrate', 'jobinvolvement',
       'joblevel', 'jobrole', 'jobsatisfaction', 'maritalstatus',
       'monthlyincome', 'monthlyrate', 'numcompaniesworked', 'overtime',
       'percentsalaryhike', 'performancerating', 'relationshipsatisfaction',
       'standardhours', 'stockoptionlevel', 'totalworkingyears',
       'trainingtimeslastyear', 'worklifebalance', 'yearsatcompany',
       'yearssincelastpromotion', 'yearswithcurrmanager', 'datebirth',
       'salary', 'remotework'],
      dtype='object')

In [243]:
df = df.rename(columns={'businesstravel': 'business_travel', 
                        'dailyrate': 'daily_rate',
                        'distancefromhome': 'distance_from_home', 
                        'educationfield': 'education_field',
                        'employeecount': 'employee_count',
                        'employeenumber': 'employee_number',
                        'environmentsatisfaction': 'environment_satisfaction',
                        'hourlyrate': 'hourly_rate',
                        'jobinvolvement': 'job_involvement',
                        'joblevel': 'job_level',
                        'jobrole': 'job_role',
                        'jobsatisfaction': 'job_satisfaction',
                        'maritalstatus': 'marital_status',
                        'monthlyincome': 'monthly_income',
                        'monthlyrate': 'monthly_rate',
                        'numcompaniesworked': 'num_companies_worked',
                        'percentsalaryhike': 'percent_salary_hike',
                        'performancerating': 'performance_rating',
                        'relationshipsatisfaction': 'relationship_satisfaction',
                        'standardhours': 'standard_hours',
                        'stockoptionlevel': 'stock_option_level',
                        'totalworkingyears': 'total_working_years',
                        'trainingtimeslastyear': 'training_times_last_year',
                        'worklifebalance': 'work_life_balance',
                        'yearsatcompany': 'years_at_company',
                        'yearsincurrentrole': 'yearsincurrentrole',
                        'yearssincelastpromotion': 'years_since_last_promotion',
                        'yearswithcurrmanager': 'years_with_curr_manager',
                        'datebirth': 'date_birth', 
                        'roledepartament': 'role_departament',
                        'remotework': 'remote_work'})

In [244]:
df.columns

Index(['age', 'attrition', 'business_travel', 'daily_rate', 'department',
       'distance_from_home', 'education', 'education_field', 'employee_number',
       'environment_satisfaction', 'gender', 'hourly_rate', 'job_involvement',
       'job_level', 'job_role', 'job_satisfaction', 'marital_status',
       'monthly_income', 'monthly_rate', 'num_companies_worked', 'overtime',
       'percent_salary_hike', 'performance_rating',
       'relationship_satisfaction', 'standard_hours', 'stock_option_level',
       'total_working_years', 'training_times_last_year', 'work_life_balance',
       'years_at_company', 'years_since_last_promotion',
       'years_with_curr_manager', 'date_birth', 'salary', 'remote_work'],
      dtype='object')

In [245]:
nulls(df,1,1)

Count of nulls
department             1312
hourly_rate            1210
business_travel         772
overtime                676
marital_status          651
total_working_years     526
monthly_income          468
salary                  274
performance_rating      195
work_life_balance       108
dtype: int64
-----------------------------------
share of nulls
department             81.288724
hourly_rate            74.969021
business_travel        47.831475
overtime               41.883519
marital_status         40.334572
total_working_years    32.589839
monthly_income         28.996283
salary                 16.976456
performance_rating     12.081784
work_life_balance       6.691450
dtype: float64

                   var  perc_nulos
0      business_travel   47.831475
1           department   81.288724
2          hourly_rate   74.969021
3       marital_status   40.334572
4       monthly_income   28.996283
5             overtime   41.883519
6   performance_rating   12.081784
7  total_working_years   32.589839
8    work_life_balance    6.691450
9               salary   16.976456

In [246]:
df['department'].unique()

array([nan, 'research_&_development', 'sales', 'human_resources'],
      dtype=object)

In [247]:
df.columns

Index(['age', 'attrition', 'business_travel', 'daily_rate', 'department',
       'distance_from_home', 'education', 'education_field', 'employee_number',
       'environment_satisfaction', 'gender', 'hourly_rate', 'job_involvement',
       'job_level', 'job_role', 'job_satisfaction', 'marital_status',
       'monthly_income', 'monthly_rate', 'num_companies_worked', 'overtime',
       'percent_salary_hike', 'performance_rating',
       'relationship_satisfaction', 'standard_hours', 'stock_option_level',
       'total_working_years', 'training_times_last_year', 'work_life_balance',
       'years_at_company', 'years_since_last_promotion',
       'years_with_curr_manager', 'date_birth', 'salary', 'remote_work'],
      dtype='object')

In [248]:
df.to_csv("df_transformado.csv", index=False)